*** Tag statistics
The following source block generates a list of tags in this document.
If you have [[https://github.com/alphapapa/org-ql/][org-ql]] installed, you can browse matching entries by pressing =C-c C-o= on a link in the table.

#+name: tag-statistics
#+begin_src emacs-lisp :tangle no
  (->> (org-ql-select (current-buffer)
         '(and (level > 2)
               (not (tags "ARCHIVE"))
               (not (tags "noexport")))
         :action '(org-get-tags))
       (--filter (not (member "@note" it)))
       (-flatten-n 1)
       (-group-by #'identity)
       (-map (pcase-lambda (`(,tag . ,items))
               (cons tag (length items))))
       (-sort (-on #'> #'cdr))
       (-map (pcase-lambda (`(,tag . ,count))
               (list (format "[[org-ql-search:tags:%s][%s]]" tag tag)
                     count))))
#+end_src

#+RESULTS: tag-statistics
| [[org-ql-search:tags:packages][packages]]            | 205 |
| [[org-ql-search:tags:visual][visual]]              |  14 |
| [[org-ql-search:tags:UI][UI]]                  |  13 |
| [[org-ql-search:tags:development][development]]         |  12 |
| [[org-ql-search:tags:formatting][formatting]]          |  11 |
| [[org-ql-search:tags:VC][VC]]                  |   9 |
| [[org-ql-search:tags:library][library]]             |   8 |
| [[org-ql-search:tags:completion][completion]]          |   8 |
| [[org-ql-search:tags:Emacs][Emacs]]               |   7 |
| [[org-ql-search:tags:editing][editing]]             |   7 |
| [[org-ql-search:tags:major__mode][major__mode]]         |   6 |
| [[org-ql-search:tags:keybindings][keybindings]]         |   6 |
| [[org-ql-search:tags:Emacs__Lisp][Emacs__Lisp]]         |   5 |
| [[org-ql-search:tags:process][process]]             |   4 |
| [[org-ql-search:tags:dired][dired]]               |   4 |
| [[org-ql-search:tags:files][files]]               |   4 |
| [[org-ql-search:tags:history][history]]             |   4 |
| [[org-ql-search:tags:writing][writing]]             |   4 |
| [[org-ql-search:tags:windows][windows]]             |   4 |
| [[org-ql-search:tags:IO][IO]]                  |   3 |
| [[org-ql-search:tags:parentheses][parentheses]]         |   3 |
| [[org-ql-search:tags:minibuffer][minibuffer]]          |   3 |
| [[org-ql-search:tags:navigation][navigation]]          |   3 |
| [[org-ql-search:tags:reference][reference]]           |   3 |
| [[org-ql-search:tags:project][project]]             |   3 |
| [[org-ql-search:tags:major_mode][major_mode]]          |   3 |
| [[org-ql-search:tags:web][web]]                 |   3 |
| [[org-ql-search:tags:structured__editing][structured__editing]] |   3 |
| [[org-ql-search:tags:Japanese][Japanese]]            |   3 |
| [[org-ql-search:tags:expansion][expansion]]           |   2 |
| [[org-ql-search:tags:diff][diff]]                |   2 |
| [[org-ql-search:tags:regexp][regexp]]              |   2 |
| [[org-ql-search:tags:links][links]]               |   2 |
| [[org-ql-search:tags:git][git]]                 |   2 |
| [[org-ql-search:tags:Nix][Nix]]                 |   2 |
| [[org-ql-search:tags:syntax][syntax]]              |   2 |
| [[org-ql-search:tags:tree_sitter][tree_sitter]]         |   2 |
| [[org-ql-search:tags:configuration][configuration]]       |   2 |
| [[org-ql-search:tags:performance][performance]]         |   1 |
| [[org-ql-search:tags:help][help]]                |   1 |
| [[org-ql-search:tags:prog_mode][prog_mode]]           |   1 |
| [[org-ql-search:tags:text_mode][text_mode]]           |   1 |
| [[org-ql-search:tags:text][text]]                |   1 |
| [[org-ql-search:tags:profiling][profiling]]           |   1 |
| [[org-ql-search:tags:Prolog][Prolog]]              |   1 |
| [[org-ql-search:tags:bibliography][bibliography]]        |   1 |
| [[org-ql-search:tags:capture][capture]]             |   1 |
| [[org-ql-search:tags:documentation][documentation]]       |   1 |
| [[org-ql-search:tags:secrets][secrets]]             |   1 |
| [[org-ql-search:tags:clipboard][clipboard]]           |   1 |
| [[org-ql-search:tags:@extra][@extra]]              |   1 |
| [[org-ql-search:tags:beancount][beancount]]           |   1 |
| [[org-ql-search:tags:testing][testing]]             |   1 |
| [[org-ql-search:tags:grep][grep]]                |   1 |
| [[org-ql-search:tags:search][search]]              |   1 |
| [[org-ql-search:tags:LSP][LSP]]                 |   1 |
| [[org-ql-search:tags:direnv][direnv]]              |   1 |
| [[org-ql-search:tags:dictionary][dictionary]]          |   1 |
| [[org-ql-search:tags:window][window]]              |   1 |
| [[org-ql-search:tags:screen__recording][screen__recording]]   |   1 |
| [[org-ql-search:tags:translation][translation]]         |   1 |
| [[org-ql-search:tags:Terraform][Terraform]]           |   1 |
| [[org-ql-search:tags:OSS][OSS]]                 |   1 |
| [[org-ql-search:tags:emacs_lisp][emacs_lisp]]          |   1 |
| [[org-ql-search:tags:aesthetics][aesthetics]]          |   1 |
| [[org-ql-search:tags:reading][reading]]             |   1 |
| [[org-ql-search:tags:EPUB][EPUB]]                |   1 |
| [[org-ql-search:tags:Chinese][Chinese]]             |   1 |
| [[org-ql-search:tags:colors][colors]]              |   1 |
| [[org-ql-search:tags:graphics][graphics]]            |   1 |
| [[org-ql-search:tags:debugging][debugging]]           |   1 |
| [[org-ql-search:tags:terminal][terminal]]            |   1 |
| [[org-ql-search:tags:usability][usability]]           |   1 |

Note that the table above is invisible on GitHub.
There is a table right before paragraph.
